/** 
      @file main.c
      
      Модульний контроль. Необхідно створити свій калькулятор математичних виразів. Створити функцію, що приймає строку (напр. `3+5*2-67*3`) та повертає число - результат обчислення.
 
      @author Melnik B. 
*/ 
 
 /** 
 Заголовний файл 
*/ 

#include "lib.h"
#include <stdio.h>

/** Розрахунок математичних виразів.

@param statement - це масив символів типу char, який використовується для збереження математичного виразу, який користувач вводить з клавіатури за допомогою функції fgets.
@param result - це змінна типу int, яка використовується для зберігання результату обчислення математичного виразу, який був збережений у змінній statement. Значення цієї змінної отримується за допомогою функції calculate.
@return код помилки 0
*/

/** MAX_STATEMENT_LENGTH - це константа, яка вказує на максимальну довжину математичного виразу, який може бути збережений у змінній statement. Це число використовується для визначення розміру масиву statement.
*/
#define MAX_STATEMENT_LENGTH 1000

/** int main точка входу до програми
*/

int main() {
    char statement[MAX_STATEMENT_LENGTH];
    printf("Введіть математичний вираз: ");
    fgets(statement, MAX_STATEMENT_LENGTH, stdin);
    int result = calculate(statement);
    printf("Результат: %d\n", result);
    return 0;
}



